programming/golang/learn-go-note/learning-go.org
#+TITLE: learning go 笔记
#+AUTHOR: 赵文彬
#+LATEX_HEADER: \usepackage{xeCJK}

* Introduction

** 语言的特性

- Clean and Simple
- Concurrent ( goroutine 轻量级线程 )
- Channels
- Fast 编译和运行
- Safe 显示要求和严格的规则，内存回收
- gofmt
- Postfix types
- UTF8 (python3 级)
- Open Source
- Fun

** 查看帮助

- =godoc builtin= :: 类似于 =java.lang.System=
- =godoc hash= :: 查看包的手册

* 基础

** TODO hello world

#+BEGIN_SRC go
package main

import "fmt"

func main() {
    fmt.Printf( "Hello World." )
}
#+END_SRC

- 可执行程序包名必须是 =main=
- 可执行程序的入口是 =main.main()=
- main 的参数由 sys 传入?（类似 python）


** 编译执行

#+BEGIN_SRC shell
go build helloworld.go
#+END_SRC

- 文件名可以与包名不一致
- 生成结果与文件名一致
- 可以直接使用 =go run helloworld.go= 来运行




** 基础类型和变量 

*** 类型后缀形式

#+BEGIN_SRC go
var a int
#+END_SRC

类型有默认的空值

*** 声明与初始化可以写在一起

如 ~var a = 15; a := 15~ 等价于 ~a = 15~

~:=~ 是赋值语句，只能用在函数内部

*** 多个变量申明

多变量申明可以放于一起，类似的还有 =const= 和 =import=，如

#+BEGIN_SRC go
var (
  x int
  b bool
)
#+END_SRC

相同类型的变量可以一起申明或赋值

#+BEGIN_SRC
var x, y int 
a, b := 20, 16
#+END_SRC

*** 特殊变量 ~`_`~

类似于 lua，表示丢弃这一变量

go 中检查比较严格，发现未使用的变量会报错，使用 ~_~ 来显示的解决错误

*** Boolean 

- 关键字是 =bool=
- 两个字面值是 ~true~ 和 ~false~

*** Numerical

- ~int~ :: 宽度视平台而定
- ~uint~ :: 同上
- ~[u]int{8,16,32,64}~ :: 指定具体宽度
- ~byte~ :: 对应 ~uint8~
- ~float{32,64}~ :: 浮点数（无 double）

**** TODO 类型转换

不同类型之前直接不可赋值或计算 

*** Constants

在编译时生成，只能是数字、字符串或布尔值。

**** TODO 枚举

使用 ~iota~ 来生成枚举（ iota 指极少量）

为什么这里的 iota 可以省略？

#+BEGIN_SRC go
const (
  a = iota
  b
)
#+END_SRC







*** TODO Strings

- 以双引号表示
- ？单引号表示字符？
- 字符串不可修改（immutable）


*** TODO Runes

是 ~int32~ 的别名，保存 utf8 编码，方便对宽字符集作操作

可以修改？


*** TODO Complex Numbers

原生支持复数，有两个类型

1. ~complex128~
2. ~complex64~

有没有字面表示方法？


*** TODO Error

- 默认值是 ~nil~







** 操作符和基本函数

go 不支持运算符重载！



** 控制结构

*** if-else

- if 可以像 for 有初始步骤
- 条件不加括号
- body 必须使用大括号

*** goto

- 和 C 一样，跳转到 label 处
- label 大小写无要求

*** for

- 基本形式与 C 的一致
- 可以省略初始和变化而部分，退化成 ~while(condition)~
- 可以全部省略三个参数，退化成 ~while()~
- for 中初始的变量只能在 for 中使用

*** break and continue

- 基本用法和 C 的致
- 另外可以指定退出的 label，跳出多层循环

*** range

- 关键字 ~range~ 用于迭代序列 (loop over)
- 对于 slice 或 array，返回 ~index: int~ 和 ~value: string~
- 字符串是对每个 UTF8 字符进行迭代，postition 为字节数

*** TODO switch

#+BEGIN_SRC go
switch{
  case '0' <= c && c <= '9':
    return c - '0'
  case 'a' <= c && c <= 'f':
    return c - 'a' + 10
  case 'A' <= c && c <= 'F':
    return c - 'A' + 10
}

switch i {
  case 0, 1:
    f()
  case 2: fallthrough
  case 3: 
    h()
  default:
    g()
#+END_SRC

- 匹配的可以不止是整数（与C相比）
- 不加条件的 switch 相当于 ~switch true~ ， 可以用于生成条件分支
- 不用加 break，若要生成多条件匹配，用关键字 =fallthrough=
- 默认分支用 =default= 标识
- case 后可以跟多个条件

* 内建函数

** 基础

*使用 =godoc builtin= 来查看内建函数手册*

- close :: close a channel
- delete :: delete entries in maps
- len/cap :: 长度，容量
- new :: allocating memory for user defined data types.
- make :: allocating memory for builtin types (maps,slices,channels)
- copy/append :: copy or concatenating slices
- panic,recover :: used for an exception mechanism
- complex,real,img :: deal with complex numbers

** Arrays

*** 示例

 #+BEGIN_SRC go
 var arr [10]int
 a := [3]int{1,2,3}
 b := [...]int{1,2,3,4} // composite literal
 #+END_SRC

*** 特性

- 有固定长度
- 函数参数时传递拷贝，而非指针








** Slices

- 类似于数组，但可以动态扩展（通过 *append* 和 *copy* ）方法
- 底层也是 array
- 是到 array 的指针（类似于 C++ 中的引用类型）
- 引用类型通过 *make* 生成

*** 示例

#+BEGIN_SRC go
c  := [...]int{1,2,3,4,5}
sa := make([]int, 10)
sb := c[:3]
sc := c[0:3:4] // 同时设定 cap
#+END_SRC


*** append

- append 会生成新的底层数组
- 后面跟数组元素类型时，添加元素: ~append(s,1,2,3)~
- 后面跟数组类型时，添加数组（注意 *`...`* ） ~append(s,s2...)~

#+BEGIN_SRC go
s1 := []int{1,2,3}
s2 := []int{5,6,7}
fmt.Println( append(s1,s2...) )
#+END_SRC


*** copy

- copy 返回实际拷贝长度（类似 memcpy）

** TODO Array VS Slices
*** 初始化方式

 Array 初始化时需要指定长度: `[3]int{1,2,3}` 或 `[...]int{1,2,3}` ；
 而 Slices 不需要指定: `[]int{1,2,3}`

*** TODO 如何确定 array 或 slices

** Maps

