programming/golang/learn-go-note/learning-go.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-06-10 Sat 23:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>learning go 笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="赵文彬">
<link rel="stylesheet" type="text/css" href="/diary/style/style.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">learning go 笔记</h1>
</header>
<div id="outline-container-org8ca2b9f" class="outline-2">
<h2 id="org8ca2b9f">Introduction</h2>
<div class="outline-text-2" id="text-org8ca2b9f">
</div><div id="outline-container-org48f925c" class="outline-3">
<h3 id="org48f925c">语言的特性</h3>
<div class="outline-text-3" id="text-org48f925c">
<ul class="org-ul">
<li>Clean and Simple</li>
<li>Concurrent ( goroutine 轻量级线程 )</li>
<li>Channels</li>
<li>Fast 编译和运行</li>
<li>Safe 显示要求和严格的规则，内存回收</li>
<li>gofmt</li>
<li>Postfix types</li>
<li>UTF8 (python3 级)</li>
<li>Open Source</li>
<li>Fun</li>
</ul>
</div>
</div>

<div id="outline-container-orgcea1f16" class="outline-3">
<h3 id="orgcea1f16">查看帮助</h3>
<div class="outline-text-3" id="text-orgcea1f16">
<dl class="org-dl">
<dt><code>godoc builtin</code></dt><dd>类似于 <code>java.lang.System</code></dd>
<dt><code>godoc hash</code></dt><dd>查看包的手册</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org080fd2f" class="outline-2">
<h2 id="org080fd2f">基础</h2>
<div class="outline-text-2" id="text-org080fd2f">
</div><div id="outline-container-orgffc00be" class="outline-3">
<h3 id="orgffc00be"><span class="todo TODO">TODO</span> hello world</h3>
<div class="outline-text-3" id="text-orgffc00be">
<div class="org-src-container">
<pre class="src src-go">package main

import "fmt"

func main() {
    fmt.Printf( "Hello World." )
}
</pre>
</div>

<ul class="org-ul">
<li>可执行程序包名必须是 <code>main</code></li>
<li>可执行程序的入口是 <code>main.main()</code></li>
<li>main 的参数由 sys 传入?（类似 python）</li>
</ul>
</div>
</div>


<div id="outline-container-orgabf7187" class="outline-3">
<h3 id="orgabf7187">编译执行</h3>
<div class="outline-text-3" id="text-orgabf7187">
<div class="org-src-container">
<pre class="src src-shell">go build helloworld.go
</pre>
</div>

<ul class="org-ul">
<li>文件名可以与包名不一致</li>
<li>生成结果与文件名一致</li>
<li>可以直接使用 <code>go run helloworld.go</code> 来运行</li>
</ul>
</div>
</div>




<div id="outline-container-org4f08b61" class="outline-3">
<h3 id="org4f08b61">基础类型和变量</h3>
<div class="outline-text-3" id="text-org4f08b61">
</div><div id="outline-container-org4387231" class="outline-4">
<h4 id="org4387231">类型后缀形式</h4>
<div class="outline-text-4" id="text-org4387231">
<div class="org-src-container">
<pre class="src src-go">var a int
</pre>
</div>

<p>
类型有默认的空值
</p>
</div>
</div>

<div id="outline-container-org8cce32d" class="outline-4">
<h4 id="org8cce32d">声明与初始化可以写在一起</h4>
<div class="outline-text-4" id="text-org8cce32d">
<p>
如 <code>var a = 15; a := 15</code> 等价于 <code>a = 15</code>
</p>

<p>
<code>:=</code> 是赋值语句，只能用在函数内部
</p>
</div>
</div>

<div id="outline-container-orga84143c" class="outline-4">
<h4 id="orga84143c">多个变量申明</h4>
<div class="outline-text-4" id="text-orga84143c">
<p>
多变量申明可以放于一起，类似的还有 <code>const</code> 和 =import=，如
</p>

<div class="org-src-container">
<pre class="src src-go">var (
  x int
  b bool
)
</pre>
</div>

<p>
相同类型的变量可以一起申明或赋值
</p>

<pre class="example">
var x, y int 
a, b := 20, 16
</pre>
</div>
</div>

<div id="outline-container-org77adc74" class="outline-4">
<h4 id="org77adc74">特殊变量 <code>`_`</code></h4>
<div class="outline-text-4" id="text-org77adc74">
<p>
类似于 lua，表示丢弃这一变量
</p>

<p>
go 中检查比较严格，发现未使用的变量会报错，使用 <code>_</code> 来显示的解决错误
</p>
</div>
</div>

<div id="outline-container-orgcc56953" class="outline-4">
<h4 id="orgcc56953">Boolean</h4>
<div class="outline-text-4" id="text-orgcc56953">
<ul class="org-ul">
<li>关键字是 <code>bool</code></li>
<li>两个字面值是 <code>true</code> 和 <code>false</code></li>
</ul>
</div>
</div>

<div id="outline-container-org4f0e68a" class="outline-4">
<h4 id="org4f0e68a">Numerical</h4>
<div class="outline-text-4" id="text-org4f0e68a">
<dl class="org-dl">
<dt><code>int</code></dt><dd>宽度视平台而定</dd>
<dt><code>uint</code></dt><dd>同上</dd>
<dt><code>[u]int{8,16,32,64}</code></dt><dd>指定具体宽度</dd>
<dt><code>byte</code></dt><dd>对应 <code>uint8</code></dd>
<dt><code>float{32,64}</code></dt><dd>浮点数（无 double）</dd>
</dl>
</div>

<ul class="org-ul"><li><a id="org72ae440"></a><span class="todo TODO">TODO</span> 类型转换<br><div class="outline-text-5" id="text-org72ae440">
<p>
不同类型之前直接不可赋值或计算 
</p>
</div></li></ul>
</div>

<div id="outline-container-org071bf7e" class="outline-4">
<h4 id="org071bf7e">Constants</h4>
<div class="outline-text-4" id="text-org071bf7e">
<p>
在编译时生成，只能是数字、字符串或布尔值。
</p>
</div>

<ul class="org-ul"><li><a id="org91407f5"></a><span class="todo TODO">TODO</span> 枚举<br><div class="outline-text-5" id="text-org91407f5">
<p>
使用 <code>iota</code> 来生成枚举（ iota 指极少量）
</p>

<p>
为什么这里的 iota 可以省略？
</p>

<div class="org-src-container">
<pre class="src src-go">const (
  a = iota
  b
)
</pre>
</div>
</div></li></ul>
</div>







<div id="outline-container-org85325cc" class="outline-4">
<h4 id="org85325cc"><span class="todo TODO">TODO</span> Strings</h4>
<div class="outline-text-4" id="text-org85325cc">
<ul class="org-ul">
<li>以双引号表示</li>
<li>？单引号表示字符？</li>
<li>字符串不可修改（immutable）</li>
</ul>
</div>
</div>


<div id="outline-container-org6947c2b" class="outline-4">
<h4 id="org6947c2b"><span class="todo TODO">TODO</span> Runes</h4>
<div class="outline-text-4" id="text-org6947c2b">
<p>
是 <code>int32</code> 的别名，保存 utf8 编码，方便对宽字符集作操作
</p>

<p>
可以修改？
</p>
</div>
</div>


<div id="outline-container-org91cc83b" class="outline-4">
<h4 id="org91cc83b"><span class="todo TODO">TODO</span> Complex Numbers</h4>
<div class="outline-text-4" id="text-org91cc83b">
<p>
原生支持复数，有两个类型
</p>

<ol class="org-ol">
<li><code>complex128</code></li>
<li><code>complex64</code></li>
</ol>

<p>
有没有字面表示方法？
</p>
</div>
</div>


<div id="outline-container-org75db5b8" class="outline-4">
<h4 id="org75db5b8"><span class="todo TODO">TODO</span> Error</h4>
<div class="outline-text-4" id="text-org75db5b8">
<ul class="org-ul">
<li>默认值是 <code>nil</code></li>
</ul>
</div>
</div>
</div>







<div id="outline-container-org543d4a0" class="outline-3">
<h3 id="org543d4a0">操作符和基本函数</h3>
<div class="outline-text-3" id="text-org543d4a0">
<p>
go 不支持运算符重载！
</p>
</div>
</div>



<div id="outline-container-orgf36c5cf" class="outline-3">
<h3 id="orgf36c5cf">控制结构</h3>
<div class="outline-text-3" id="text-orgf36c5cf">
</div><div id="outline-container-org2132de4" class="outline-4">
<h4 id="org2132de4">if-else</h4>
<div class="outline-text-4" id="text-org2132de4">
<ul class="org-ul">
<li>if 可以像 for 有初始步骤</li>
<li>条件不加括号</li>
<li>body 必须使用大括号</li>
</ul>
</div>
</div>

<div id="outline-container-orgaa71111" class="outline-4">
<h4 id="orgaa71111">goto</h4>
<div class="outline-text-4" id="text-orgaa71111">
<ul class="org-ul">
<li>和 C 一样，跳转到 label 处</li>
<li>label 大小写无要求</li>
</ul>
</div>
</div>

<div id="outline-container-org9117da3" class="outline-4">
<h4 id="org9117da3">for</h4>
<div class="outline-text-4" id="text-org9117da3">
<ul class="org-ul">
<li>基本形式与 C 的一致</li>
<li>可以省略初始和变化而部分，退化成 <code>while(condition)</code></li>
<li>可以全部省略三个参数，退化成 <code>while()</code></li>
<li>for 中初始的变量只能在 for 中使用</li>
</ul>
</div>
</div>

<div id="outline-container-org7aaa31c" class="outline-4">
<h4 id="org7aaa31c">break and continue</h4>
<div class="outline-text-4" id="text-org7aaa31c">
<ul class="org-ul">
<li>基本用法和 C 的致</li>
<li>另外可以指定退出的 label，跳出多层循环</li>
</ul>
</div>
</div>

<div id="outline-container-org5234758" class="outline-4">
<h4 id="org5234758">range</h4>
<div class="outline-text-4" id="text-org5234758">
<ul class="org-ul">
<li>关键字 <code>range</code> 用于迭代序列 (loop over)</li>
<li>对于 slice 或 array，返回 <code>index: int</code> 和 <code>value: string</code></li>
<li>字符串是对每个 UTF8 字符进行迭代，postition 为字节数</li>
</ul>
</div>
</div>

<div id="outline-container-org050b8f1" class="outline-4">
<h4 id="org050b8f1"><span class="todo TODO">TODO</span> switch</h4>
<div class="outline-text-4" id="text-org050b8f1">
<div class="org-src-container">
<pre class="src src-go">switch{
  case '0' &lt;= c &amp;&amp; c &lt;= '9':
    return c - '0'
  case 'a' &lt;= c &amp;&amp; c &lt;= 'f':
    return c - 'a' + 10
  case 'A' &lt;= c &amp;&amp; c &lt;= 'F':
    return c - 'A' + 10
}

switch i {
  case 0, 1:
    f()
  case 2: fallthrough
  case 3: 
    h()
  default:
    g()
</pre>
</div>

<ul class="org-ul">
<li>匹配的可以不止是整数（与C相比）</li>
<li>不加条件的 switch 相当于 <code>switch true</code> ， 可以用于生成条件分支</li>
<li>不用加 break，若要生成多条件匹配，用关键字 <code>fallthrough</code></li>
<li>默认分支用 <code>default</code> 标识</li>
<li>case 后可以跟多个条件</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org4869bbf" class="outline-2">
<h2 id="org4869bbf">内建函数</h2>
<div class="outline-text-2" id="text-org4869bbf">
</div><div id="outline-container-orgeb017c7" class="outline-3">
<h3 id="orgeb017c7">基础</h3>
<div class="outline-text-3" id="text-orgeb017c7">
<p>
<b>使用 <code>godoc builtin</code> 来查看内建函数手册</b>
</p>

<dl class="org-dl">
<dt>close</dt><dd>close a channel</dd>
<dt>delete</dt><dd>delete entries in maps</dd>
<dt>len/cap</dt><dd>长度，容量</dd>
<dt>new</dt><dd>allocating memory for user defined data types.</dd>
<dt>make</dt><dd>allocating memory for builtin types (maps,slices,channels)</dd>
<dt>copy/append</dt><dd>copy or concatenating slices</dd>
<dt>panic,recover</dt><dd>used for an exception mechanism</dd>
<dt>complex,real,img</dt><dd>deal with complex numbers</dd>
</dl>
</div>
</div>

<div id="outline-container-org7b27e1d" class="outline-3">
<h3 id="org7b27e1d">Arrays</h3>
<div class="outline-text-3" id="text-org7b27e1d">
</div><div id="outline-container-org2d3e327" class="outline-4">
<h4 id="org2d3e327">示例</h4>
<div class="outline-text-4" id="text-org2d3e327">
<div class="org-src-container">
<pre class="src src-go">var arr [10]int
a := [3]int{1,2,3}
b := [...]int{1,2,3,4} // composite literal
</pre>
</div>
</div>
</div>

<div id="outline-container-org055efd8" class="outline-4">
<h4 id="org055efd8">特性</h4>
<div class="outline-text-4" id="text-org055efd8">
<ul class="org-ul">
<li>有固定长度</li>
<li>函数参数时传递拷贝，而非指针</li>
</ul>
</div>
</div>
</div>








<div id="outline-container-org291106a" class="outline-3">
<h3 id="org291106a">Slices</h3>
<div class="outline-text-3" id="text-org291106a">
<ul class="org-ul">
<li>类似于数组，但可以动态扩展（通过 <b>append</b> 和 <b>copy</b> ）方法</li>
<li>底层也是 array</li>
<li>是到 array 的指针（类似于 C++ 中的引用类型）</li>
<li>引用类型通过 <b>make</b> 生成</li>
</ul>
</div>

<div id="outline-container-org68ea17d" class="outline-4">
<h4 id="org68ea17d">示例</h4>
<div class="outline-text-4" id="text-org68ea17d">
<div class="org-src-container">
<pre class="src src-go">c  := [...]int{1,2,3,4,5}
sa := make([]int, 10)
sb := c[:3]
sc := c[0:3:4] // 同时设定 cap
</pre>
</div>
</div>
</div>


<div id="outline-container-org6f49358" class="outline-4">
<h4 id="org6f49358">append</h4>
<div class="outline-text-4" id="text-org6f49358">
<ul class="org-ul">
<li>append 会生成新的底层数组</li>
<li>后面跟数组元素类型时，添加元素: <code>append(s,1,2,3)</code></li>
<li>后面跟数组类型时，添加数组（注意 <b>`&#x2026;`</b> ） <code>append(s,s2...)</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-go">s1 := []int{1,2,3}
s2 := []int{5,6,7}
fmt.Println( append(s1,s2...) )
</pre>
</div>
</div>
</div>


<div id="outline-container-org037ff2e" class="outline-4">
<h4 id="org037ff2e">copy</h4>
<div class="outline-text-4" id="text-org037ff2e">
<ul class="org-ul">
<li>copy 返回实际拷贝长度（类似 memcpy）</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5b53952" class="outline-3">
<h3 id="org5b53952"><span class="todo TODO">TODO</span> Array VS Slices</h3>
<div class="outline-text-3" id="text-org5b53952">
</div><div id="outline-container-org01e7a75" class="outline-4">
<h4 id="org01e7a75">初始化方式</h4>
<div class="outline-text-4" id="text-org01e7a75">
<p>
Array 初始化时需要指定长度: `[3]int{1,2,3}` 或 `[&#x2026;]int{1,2,3}` ；
而 Slices 不需要指定: `[]int{1,2,3}`
</p>
</div>
</div>

<div id="outline-container-org2852bba" class="outline-4">
<h4 id="org2852bba"><span class="todo TODO">TODO</span> 如何确定 array 或 slices</h4>
</div>
</div>
