programming/golang/learn-go-note/learning-go.org
*** 类比

- Perl 中的 hash
- python 中的 dictionary
- C++ 中的maps

*** 语法

#+BEGIN_SRC go
monthdays := map[string]int{
  "Jan": 31, "Feb": 28, "Mar": 31,
  "Apr": 30, "May": 31, "Jun": 30,
  "Jul": 31, "Aug": 31, "Sep": 30,
  "Oct": 31, "Nov": 30, "Dec": 31,
}
#+END_SRC

- 通用的语法是: ~map[<from type>]<to type>~
- 注意， *结尾的逗号是必须的*
- 使用 ~make[string]int~ 来生成一个 map
- map 是一个引用类型
- 与数组一样，通过方括号进行访问
- 通过 *range* 来迭代
- 通过 ~value, present := monthdays["Jan"]~ 来测试是否存在
- 通过 ~delete( monthdays, "Mar" )~ 来删除键值

* 函数

** TODO receiver
** 定义函数

#+BEGIN_SRC go
type mytype int
func ( p mytype ) funcname ( q int ) ( r, s int ) { return 0, 0 }
#+END_SRC

*** TODO 说明

- optionally bind to a specific type called receiver ( method )
- parameters are passed pass-by-value
- functions in Go can have multiple return values
- named result parameters, return 后不加参数时被返回
- 函数可以以任意顺序声明（与 C 需要声明不同）
- 不允许函数嵌套定义！！但可以使用匿名函数
- 可以递归。尾递归？？



** 作用域

- 注意赋值 ~=~ 与定义 ~:=~ 的区别
- 函数的局部变量不会绑定到要调用的函数环境中

** 高阶函数

#+BEGIN_SRC go
var xs = map[int]func() int{
  1: func() int {return 10},
  2: func() int {return 20},
  3: func() int {return 30},
}
#+END_SRC

** defer

- 不是 lazy eval，而类似于 atexit。在函数退出时被回调
- 可以多次注册，以 LIFO （栈）形式被回调
- defer 还可以用于装饰返回结果（如 JSON 序列化）

** 变长参数列表

类似于 scala，示例如下：

#+BEGIN_SRC go
func myfunc2( args ...string ) {
        for _, v := range args {
                fmt.Println( v )
        }
}

func myfunc( args ...string ) {
        myfunc2( args[3:]... )
}
#+END_SRC

*** TODO interface

If you don't specify the type of the varadic argument
it defaults to the empty interface =interface{}=

** Panic and recovering

*** TODO Exception vs Panic-Recovering

GO 不提供异常捕获机制

**** TODO 原因

**** TODO 区别

**** TODO 细节

***** Panic

- 函数调用 ~panic~ 时，函数的 defer 被回调，然后返回到被调用处
- 对外层函数，触发 panic 的函数，此时相当于一个 panic
- 沿着栈回溯向下

***** Recover

- 正常执行中，返回 nil，无其它作用
- 用于恢复被 panic 打断的执行



* Packages

** 定义

A package is a collection of functions and data.

** 说明

- 文件名与包名无关
- 包名通常用小写命名
- 多个文件可以取相同的包名
- 包里的以大写开头的函数对外可见（exported）
- 导入名与代码路径一致
- 包名是路径的最后一级
- ~import bar "bytes"~ 重命名包

** TODO 多文件包融合问题

** TODO Document

- 在 =package= 关键字节可以加入块级注释，作为代码的文档
- 用 =go doc= 来查看
- 多文件的包应该只写一次（重复写会怎样？）
- 习惯上建立一个 =doc.go= 来写文档
- 函数注释同理


** TODO Testing packages

- 使用 =testing= 包提供的功能
- 调用 =go test= 测试
- test 文件以 =*_test.go= 为后缀
- test 函数原型是 ~Test: func TestXxx( t *testing.T )~
- 使用 ~go doc testing~ 或 ~go help testfun~ 来查看帮助

*** 常用函数

- ~func (t *T) Fail()~ :: failed but continues execution
- ~func (t *T) FailNow()~ :: fail and stop execution
- ~func (t *T) Log( args ...interface{} )~ :: error log
- ~func (t *T) Fatal(args ...interface{} )~ :: Log + FailNow








** 常用 Packages

*** 列表

- fmt :: 注意比 C 多出的 =%v=, =%#v=, =%T=
- io :: I/O primitives
- bufio :: buffered I/O
- sort :: sorting
- strconv :: string <-> basic data type
- os :: platform-independent interface
- sync :: synchronization primitives such as mutual exclusion locks
- flag :: argparses or getopt
- encoding/json :: RFC4627
- html/template :: generate HTML
- net/http :: HTTP server/client
- unsafe :: ??
- reflect :: run-time reflection
- os/exec :: os.system in python

*** 其它

- 在 =$GOROOT/src/pkg= 目录下查看


* Beyond the basics

** Pointer

*** 概念

- Go has pointers. 
- There is however no pointer arithmetic
- Go pointers act more like references than pointers in C

*** 语法

- 在类型前前缀 '*'
- 默认指向 =nil=
- 使用 '&' 来取地址，并给指针赋值
- 使用 '*' 来反引用（取指向数据）

*** 例子

#+BEGIN_SRC go
var p *int
fmt.Printf( "%v %T\n", p, p )

var i int
p = &i
fmt.Printf( "%v %v %T\n", p, *p, p )
#+END_SRC




** Allocation

*** 概念

- go 有自动内存管理，无须手动释放
- 申请有两个原语: ~new~ 和 ~make~
- *new* alloctes; *make* initializes


*** new

=new(T)= 为类型 T 申请一个空的空间，返回地址( *T )


*** make

- =make(T, args)= 用于创建 slices, map, 或 channels
- 返回是 T 本身，而非地址

** Composite literals

Composite literal is an expression that creates a new instance each time it is evaluated.

*** TODO 例子

#+BEGIN_SRC go
func NewFile( fd int, name string )*File {
  if fd < 0 {
    return nil
  }

  f := File{fd, name, nil, 0}
  return &f
}
#+END_SRC

注意返回一个局部变量 f 在 golang 中是允许的，go 会自动提升变量存活时长


