programming/golang/learn-go-note/learning-go.html

<div id="outline-container-orgb03b90a" class="outline-3">
<h3 id="orgb03b90a">Maps</h3>
<div class="outline-text-3" id="text-orgb03b90a">
</div><div id="outline-container-orgb065d88" class="outline-4">
<h4 id="orgb065d88">类比</h4>
<div class="outline-text-4" id="text-orgb065d88">
<ul class="org-ul">
<li>Perl 中的 hash</li>
<li>python 中的 dictionary</li>
<li>C++ 中的maps</li>
</ul>
</div>
</div>

<div id="outline-container-orgc09d586" class="outline-4">
<h4 id="orgc09d586">语法</h4>
<div class="outline-text-4" id="text-orgc09d586">
<div class="org-src-container">
<pre class="src src-go">monthdays := map[string]int{
  "Jan": 31, "Feb": 28, "Mar": 31,
  "Apr": 30, "May": 31, "Jun": 30,
  "Jul": 31, "Aug": 31, "Sep": 30,
  "Oct": 31, "Nov": 30, "Dec": 31,
}
</pre>
</div>

<ul class="org-ul">
<li>通用的语法是: <code>map[&lt;from type&gt;]&lt;to type&gt;</code></li>
<li>注意， <b>结尾的逗号是必须的</b></li>
<li>使用 <code>make[string]int</code> 来生成一个 map</li>
<li>map 是一个引用类型</li>
<li>与数组一样，通过方括号进行访问</li>
<li>通过 <b>range</b> 来迭代</li>
<li>通过 <code>value, present := monthdays["Jan"]</code> 来测试是否存在</li>
<li>通过 <code>delete( monthdays, "Mar" )</code> 来删除键值</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orga9326d4" class="outline-2">
<h2 id="orga9326d4">函数</h2>
<div class="outline-text-2" id="text-orga9326d4">
</div><div id="outline-container-orge8c4a26" class="outline-3">
<h3 id="orge8c4a26"><span class="todo TODO">TODO</span> receiver</h3>
</div>
<div id="outline-container-org33f90a1" class="outline-3">
<h3 id="org33f90a1">定义函数</h3>
<div class="outline-text-3" id="text-org33f90a1">
<div class="org-src-container">
<pre class="src src-go">type mytype int
func ( p mytype ) funcname ( q int ) ( r, s int ) { return 0, 0 }
</pre>
</div>
</div>

<div id="outline-container-org85a4dbb" class="outline-4">
<h4 id="org85a4dbb"><span class="todo TODO">TODO</span> 说明</h4>
<div class="outline-text-4" id="text-org85a4dbb">
<ul class="org-ul">
<li>optionally bind to a specific type called receiver ( method )</li>
<li>parameters are passed pass-by-value</li>
<li>functions in Go can have multiple return values</li>
<li>named result parameters, return 后不加参数时被返回</li>
<li>函数可以以任意顺序声明（与 C 需要声明不同）</li>
<li>不允许函数嵌套定义！！但可以使用匿名函数</li>
<li>可以递归。尾递归？？</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org4f530b0" class="outline-3">
<h3 id="org4f530b0">作用域</h3>
<div class="outline-text-3" id="text-org4f530b0">
<ul class="org-ul">
<li>注意赋值 <code>=</code> 与定义 <code>:=</code> 的区别</li>
<li>函数的局部变量不会绑定到要调用的函数环境中</li>
</ul>
</div>
</div>

<div id="outline-container-orga8f0d28" class="outline-3">
<h3 id="orga8f0d28">高阶函数</h3>
<div class="outline-text-3" id="text-orga8f0d28">
<div class="org-src-container">
<pre class="src src-go">var xs = map[int]func() int{
  1: func() int {return 10},
  2: func() int {return 20},
  3: func() int {return 30},
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org039bf38" class="outline-3">
<h3 id="org039bf38">defer</h3>
<div class="outline-text-3" id="text-org039bf38">
<ul class="org-ul">
<li>不是 lazy eval，而类似于 atexit。在函数退出时被回调</li>
<li>可以多次注册，以 LIFO （栈）形式被回调</li>
<li>defer 还可以用于装饰返回结果（如 JSON 序列化）</li>
</ul>
</div>
</div>

<div id="outline-container-orgb813642" class="outline-3">
<h3 id="orgb813642">变长参数列表</h3>
<div class="outline-text-3" id="text-orgb813642">
<p>
类似于 scala，示例如下：
</p>

<div class="org-src-container">
<pre class="src src-go">func myfunc2( args ...string ) {
	for _, v := range args {
		fmt.Println( v )
	}
}

func myfunc( args ...string ) {
	myfunc2( args[3:]... )
}
</pre>
</div>
</div>

<div id="outline-container-orgd499b82" class="outline-4">
<h4 id="orgd499b82"><span class="todo TODO">TODO</span> interface</h4>
<div class="outline-text-4" id="text-orgd499b82">
<p>
If you don't specify the type of the varadic argument
it defaults to the empty interface <code>interface{}</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org4c18b7e" class="outline-3">
<h3 id="org4c18b7e">Panic and recovering</h3>
<div class="outline-text-3" id="text-org4c18b7e">
</div><div id="outline-container-orgac34504" class="outline-4">
<h4 id="orgac34504"><span class="todo TODO">TODO</span> Exception vs Panic-Recovering</h4>
<div class="outline-text-4" id="text-orgac34504">
<p>
GO 不提供异常捕获机制
</p>
</div>

<ul class="org-ul"><li><a id="org1fd82ef"></a><span class="todo TODO">TODO</span> 原因<br></li>

<li><a id="org3cfcc5c"></a><span class="todo TODO">TODO</span> 区别<br></li>

<li><a id="orgd850b8b"></a><span class="todo TODO">TODO</span> 细节<br><ul class="org-ul"><li><a id="org86250df"></a>Panic<br><div class="outline-text-6" id="text-org86250df">
<ul class="org-ul">
<li>函数调用 <code>panic</code> 时，函数的 defer 被回调，然后返回到被调用处</li>
<li>对外层函数，触发 panic 的函数，此时相当于一个 panic</li>
<li>沿着栈回溯向下</li>
</ul>
</div></li>

<li><a id="org73056e9"></a>Recover<br><div class="outline-text-6" id="text-org73056e9">
<ul class="org-ul">
<li>正常执行中，返回 nil，无其它作用</li>
<li>用于恢复被 panic 打断的执行</li>
</ul>
</div></li></ul></li></ul>
</div>
</div>
</div>



<div id="outline-container-org92b60b7" class="outline-2">
<h2 id="org92b60b7">Packages</h2>
<div class="outline-text-2" id="text-org92b60b7">
</div><div id="outline-container-orgd06e21a" class="outline-3">
<h3 id="orgd06e21a">定义</h3>
<div class="outline-text-3" id="text-orgd06e21a">
<p>
A package is a collection of functions and data.
</p>
</div>
</div>

<div id="outline-container-orga2cfc88" class="outline-3">
<h3 id="orga2cfc88">说明</h3>
<div class="outline-text-3" id="text-orga2cfc88">
<ul class="org-ul">
<li>文件名与包名无关</li>
<li>包名通常用小写命名</li>
<li>多个文件可以取相同的包名</li>
<li>包里的以大写开头的函数对外可见（exported）</li>
<li>导入名与代码路径一致</li>
<li>包名是路径的最后一级</li>
<li><code>import bar "bytes"</code> 重命名包</li>
</ul>
</div>
</div>

<div id="outline-container-orgd4d125a" class="outline-3">
<h3 id="orgd4d125a"><span class="todo TODO">TODO</span> 多文件包融合问题</h3>
</div>

<div id="outline-container-org4197d0e" class="outline-3">
<h3 id="org4197d0e"><span class="todo TODO">TODO</span> Document</h3>
<div class="outline-text-3" id="text-org4197d0e">
<ul class="org-ul">
<li>在 <code>package</code> 关键字节可以加入块级注释，作为代码的文档</li>
<li>用 <code>go doc</code> 来查看</li>
<li>多文件的包应该只写一次（重复写会怎样？）</li>
<li>习惯上建立一个 <code>doc.go</code> 来写文档</li>
<li>函数注释同理</li>
</ul>
</div>
</div>


<div id="outline-container-orge560ed1" class="outline-3">
<h3 id="orge560ed1"><span class="todo TODO">TODO</span> Testing packages</h3>
<div class="outline-text-3" id="text-orge560ed1">
<ul class="org-ul">
<li>使用 <code>testing</code> 包提供的功能</li>
<li>调用 <code>go test</code> 测试</li>
<li>test 文件以 <code>*_test.go</code> 为后缀</li>
<li>test 函数原型是 <code>Test: func TestXxx( t *testing.T )</code></li>
<li>使用 <code>go doc testing</code> 或 <code>go help testfun</code> 来查看帮助</li>
</ul>
</div>

<div id="outline-container-org95d6527" class="outline-4">
<h4 id="org95d6527">常用函数</h4>
<div class="outline-text-4" id="text-org95d6527">
<dl class="org-dl">
<dt><code>func (t *T) Fail()</code></dt><dd>failed but continues execution</dd>
<dt><code>func (t *T) FailNow()</code></dt><dd>fail and stop execution</dd>
<dt><code>func (t *T) Log( args ...interface{} )</code></dt><dd>error log</dd>
<dt><code>func (t *T) Fatal(args ...interface{} )</code></dt><dd>Log + FailNow</dd>
</dl>
</div>
</div>
</div>








<div id="outline-container-org0edc84c" class="outline-3">
<h3 id="org0edc84c">常用 Packages</h3>
<div class="outline-text-3" id="text-org0edc84c">
</div><div id="outline-container-orge2d16f2" class="outline-4">
<h4 id="orge2d16f2">列表</h4>
<div class="outline-text-4" id="text-orge2d16f2">
<dl class="org-dl">
<dt>fmt</dt><dd>注意比 C 多出的 <code>%v</code>, <code>%#v</code>, <code>%T</code></dd>
<dt>io</dt><dd>I/O primitives</dd>
<dt>bufio</dt><dd>buffered I/O</dd>
<dt>sort</dt><dd>sorting</dd>
<dt>strconv</dt><dd>string &lt;-&gt; basic data type</dd>
<dt>os</dt><dd>platform-independent interface</dd>
<dt>sync</dt><dd>synchronization primitives such as mutual exclusion locks</dd>
<dt>flag</dt><dd>argparses or getopt</dd>
<dt>encoding/json</dt><dd>RFC4627</dd>
<dt>html/template</dt><dd>generate HTML</dd>
<dt>net/http</dt><dd>HTTP server/client</dd>
<dt>unsafe</dt><dd>??</dd>
<dt>reflect</dt><dd>run-time reflection</dd>
<dt>os/exec</dt><dd>os.system in python</dd>
</dl>
</div>
</div>

<div id="outline-container-org8e38379" class="outline-4">
<h4 id="org8e38379">其它</h4>
<div class="outline-text-4" id="text-org8e38379">
<ul class="org-ul">
<li>在 <code>$GOROOT/src/pkg</code> 目录下查看</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org59e6a12" class="outline-2">
<h2 id="org59e6a12">Beyond the basics</h2>
<div class="outline-text-2" id="text-org59e6a12">
</div><div id="outline-container-org074838d" class="outline-3">
<h3 id="org074838d">Pointer</h3>
<div class="outline-text-3" id="text-org074838d">
</div><div id="outline-container-orgf4e8935" class="outline-4">
<h4 id="orgf4e8935">概念</h4>
<div class="outline-text-4" id="text-orgf4e8935">
<ul class="org-ul">
<li>Go has pointers.</li>
<li>There is however no pointer arithmetic</li>
<li>Go pointers act more like references than pointers in C</li>
</ul>
</div>
</div>

<div id="outline-container-org5110d4c" class="outline-4">
<h4 id="org5110d4c">语法</h4>
<div class="outline-text-4" id="text-org5110d4c">
<ul class="org-ul">
<li>在类型前前缀 '*'</li>
<li>默认指向 <code>nil</code></li>
<li>使用 '&amp;' 来取地址，并给指针赋值</li>
<li>使用 '*' 来反引用（取指向数据）</li>
</ul>
</div>
</div>

<div id="outline-container-org4fd13af" class="outline-4">
<h4 id="org4fd13af">例子</h4>
<div class="outline-text-4" id="text-org4fd13af">
<div class="org-src-container">
<pre class="src src-go">var p *int
fmt.Printf( "%v %T\n", p, p )

var i int
p = &amp;i
fmt.Printf( "%v %v %T\n", p, *p, p )
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-org8fc8830" class="outline-3">
<h3 id="org8fc8830">Allocation</h3>
<div class="outline-text-3" id="text-org8fc8830">
</div><div id="outline-container-org6a6b8ab" class="outline-4">
<h4 id="org6a6b8ab">概念</h4>
<div class="outline-text-4" id="text-org6a6b8ab">
<ul class="org-ul">
<li>go 有自动内存管理，无须手动释放</li>
<li>申请有两个原语: <code>new</code> 和 <code>make</code></li>
<li><b>new</b> alloctes; <b>make</b> initializes</li>
</ul>
</div>
</div>


<div id="outline-container-orgcacb774" class="outline-4">
<h4 id="orgcacb774">new</h4>
<div class="outline-text-4" id="text-orgcacb774">
<p>
<code>new(T)</code> 为类型 T 申请一个空的空间，返回地址( *T )
</p>
</div>
</div>


<div id="outline-container-orgc00c542" class="outline-4">
<h4 id="orgc00c542">make</h4>
<div class="outline-text-4" id="text-orgc00c542">
<ul class="org-ul">
<li><code>make(T, args)</code> 用于创建 slices, map, 或 channels</li>
<li>返回是 T 本身，而非地址</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcb94dcc" class="outline-3">
<h3 id="orgcb94dcc">Composite literals</h3>
<div class="outline-text-3" id="text-orgcb94dcc">
<p>
Composite literal is an expression that creates a new instance each time it is evaluated.
</p>
</div>

<div id="outline-container-orgc75ec73" class="outline-4">
<h4 id="orgc75ec73"><span class="todo TODO">TODO</span> 例子</h4>
<div class="outline-text-4" id="text-orgc75ec73">
<div class="org-src-container">
<pre class="src src-go">func NewFile( fd int, name string )*File {
  if fd &lt; 0 {
    return nil
  }

  f := File{fd, name, nil, 0}
  return &amp;f
}
</pre>
</div>

<p>
注意返回一个局部变量 f 在 golang 中是允许的，go 会自动提升变量存活时长
</p>
</div>
</div>
