programming/golang/learn-go-note/learning-go.org
*** 说明

- laid out in order and must all be present： =File{fd,name,nil,0}=
- 也可以加 label，乱序和选填： =File{fd:fd, name;name]=
- 甚至可以不填: =File{}=
- 返回是一个实例, 可以解引用： =&File{}=
- 字符串数组，忽略 field: =[...]string{Enone: "no error", Einval: "invalid argument"}=





* 自定义类型

** 基本语法

- 基本语法是 =type foo int= ，创建一个类型 foo，定义是 int
- 与 C 中的 typedef 相似，顺序相反

** 例子

#+BEGIN_SRC go
type Point struct{
        x float64
        y float64
}

func main() {
        p := &Point{x:10}
        fmt.Printf( "%v %v %T\n", p, *p, p )
}
#+END_SRC

** struct

- struct 可以没有 field
- 可以有多个 field
- 可以只有类型，称为 anonymous field
- field 以大写开关的表示全局可见，否则只能在本包内使用






* Methods

** 基础

- 目标是为类型提供方法调用
- 但不是以 Java/C++/Python OOP 形式
- 更像是 lisp/scheme 中的 GOOP 形式，或 Clojure 中的 Protocol
- 要满足 interface，必须要使用 method
- 其它情况 method 和 function 都可使用
- 对于指针的方法，可以用 =x.m()= 来简写 =(&x).m=

** TODO 继承关系



* 类型转换

- 通过操作符(operator)来转换（与函数形式一样，本质上有所不同）
- 字符串可以转换为 =byte[]= 或 =rune[]= ，反之亦然
- 自定义类型与其别名之间可以相互转换

* Interface
** 意义

- 用于函数定义与类型绑定 GOOPS
- 定义一个 interface 类型，表示方法的集合: 鸭子类型
- Go 可以使用 interface 类型作为参数类型，称为 interface value

** 示例

#+BEGIN_SRC go
type I interface {
  Get() int
  Put(int)
}

func f( p I ) {
  fmt.Println( p.Get() )
  p.Put(1)
}
#+END_SRC

** 拆分多态

#+BEGIN_SRC go
func f(p I) {
  switch t := p.(type) {
    case *S:
    case *R:
    default:
}
#+END_SRC

其中 =(.type)= 语法只在 switch 中有效，也可以写成

#+BEGIN_SRC go
if t, ok := something.(I); ok {
   // 检查 something 是否实现了接口 I
}
#+END_SRC

** Empty Interface

- 每个类型都默认实现了 =interface{}=
- 用于创建通用函数
- 通用函数，动态的获取其中的函数

*** 示例

#+BEGIN_SRC go
func g( something interface{} ) int {
    return something.(I).Get()
}
#+END_SRC

** Methods

- Methods are functions that have a receiver
- 可以对任何类型定义方法，包括内置类型（除了 int 之外）

** TODO Methods on interface faces

- An interface defines a set of methods : 定义
- A method contains the actual code ： 实现
- receiver can not be an interface type?

*** receiver type

- 有两种形式 =T= 或者 =*T=
- T is called the base type
- T must not be a pointer or interface type
- T must be declared in the same package as the method
- 不应该对 interface value 作指针

*** Interface names

- 如果只有一个方法，以 ~-er~ 为后缀，如 Reader, Writer, Formatter
- 方法名避免与标准函数重名







** TODO tag
** Introspection and reflection 

*** 示例

#+BEGIN_SRC go
type Person struct {
    name string "namestr"
    age int
}


func ShowTag( i interface[] ) {
    switch t:= reflect.TypeOf(i); t.Kind() {
    case reflect.Ptr:
        tag := t.Elem().Field(0).Tag
}
#+END_SRC


*** TODO 说明

- 要通过内存中的变量，得到关于结构体等定义信息
- 用于区分 type 和 value

* Concurrency

** 概述

- Parallelism is about performance.
- Concurrency is about program design
- 核心是 channel 和 goroutine

** goroutine

   #+BEGIN_QUOTE
   It is a function executing in parallel with other goroutines in the same address sapce. 
   It is lightweight, cosing little more than the allocation of stack space.
   And the stacks start small, so they are cheap, and grow by 
   allocating( and freeing) heap storage as required.
   #+END_QUOTE

*** 说明

- 普通函数，以关键字 =go= 开头

** channel

*** 说明

- 类似于双向的 pipe
- 只能以 channel 定义的数据类型进行交流
- 通过 =make(chan int)= 来生成
- 可以交换 interface, =make(chan interface{})= !!!
- 通过 =<-= 来发送信息和接收
- 使用函数 =select= 来监听接收信息

*** 示例

#+BEGIN_SRC go
func ready( w string, sec int ) {
    time.Sleep( time.Duration(sec) * time.Second )
    fmt.Println( w, "is ready" )
    c <- w
}

func main() {
    c = make(chan string)
    go ready( "2sec", 2 )
    go ready( "1sec", 1 )
    fmt.Println( "I'm waiting" )
    fmt.Println( <-c )
    fmt.Println( <-c )
    fmt.Println( "over" )
}
#+END_SRC

*** 缓存

- =make(chan bool)= 创建的是 unbuffered channel for bools
- unbuffered channel 用于同步多个 goroutine
- =make(chan bool, 4)= 创建带缓存的 channel

*** 关闭

- channel 会被单向关闭
- 可以以 =x, ok = <-ch= 来检查是否关闭（ok 为 false 表示关闭）


** parallel

- goroutine concurrently，而非并行
- 使用 ~runtime.GOMAXPROCS(n)~ 来设置最大并行度
- 也可以设置 =GOMAXPROCS= 环境变量
- 默认并行度是 CPU 的核数

* Communication
** 清单

- 与外界交互，如 file, directories, networking, system(shell)
- I/O 接口 =io.Reader= 和 =io.Writer=
- =os.Open=, =os.Close=, =os.Stdout=, =os.Stat=, =os.Mkdir=
- =File.Read=, =File.Write=
- bufio( Buffered I/O ), 如 NewReader, NewWriter, Read, Write, Flush, ReadString, ReadLine
- 日志 ~log~, 如 Fatalf

** 命令行参数

- os.Args （类似于 sys.args in python）
- flag 包来解析参数 （类似于 argparsers, optparser in python， getopt）
- =flag.{Bool,String}= , =flag.Usage=, =flag.Parse=, =flag.PrintDefaults=

*** TODO 效率？？

