programming/golang/learn-go-note/learning-go.html


<div id="outline-container-org07db704" class="outline-4">
<h4 id="org07db704">说明</h4>
<div class="outline-text-4" id="text-org07db704">
<ul class="org-ul">
<li>laid out in order and must all be present： <code>File{fd,name,nil,0}</code></li>
<li>也可以加 label，乱序和选填： <code>File{fd:fd, name;name]</code></li>
<li>甚至可以不填: <code>File{}</code></li>
<li>返回是一个实例, 可以解引用： <code>&amp;File{}</code></li>
<li>字符串数组，忽略 field: <code>[...]string{Enone: "no error", Einval: "invalid argument"}</code></li>
</ul>
</div>
</div>
</div>
</div>





<div id="outline-container-org21cecb8" class="outline-2">
<h2 id="org21cecb8">自定义类型</h2>
<div class="outline-text-2" id="text-org21cecb8">
</div><div id="outline-container-org10f8034" class="outline-3">
<h3 id="org10f8034">基本语法</h3>
<div class="outline-text-3" id="text-org10f8034">
<ul class="org-ul">
<li>基本语法是 <code>type foo int</code> ，创建一个类型 foo，定义是 int</li>
<li>与 C 中的 typedef 相似，顺序相反</li>
</ul>
</div>
</div>

<div id="outline-container-orge24dea7" class="outline-3">
<h3 id="orge24dea7">例子</h3>
<div class="outline-text-3" id="text-orge24dea7">
<div class="org-src-container">
<pre class="src src-go">type Point struct{
	x float64
	y float64
}

func main() {
	p := &amp;Point{x:10}
	fmt.Printf( "%v %v %T\n", p, *p, p )
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5863624" class="outline-3">
<h3 id="org5863624">struct</h3>
<div class="outline-text-3" id="text-org5863624">
<ul class="org-ul">
<li>struct 可以没有 field</li>
<li>可以有多个 field</li>
<li>可以只有类型，称为 anonymous field</li>
<li>field 以大写开关的表示全局可见，否则只能在本包内使用</li>
</ul>
</div>
</div>
</div>






<div id="outline-container-org0ac9ec6" class="outline-2">
<h2 id="org0ac9ec6">Methods</h2>
<div class="outline-text-2" id="text-org0ac9ec6">
</div><div id="outline-container-orgc544e57" class="outline-3">
<h3 id="orgc544e57">基础</h3>
<div class="outline-text-3" id="text-orgc544e57">
<ul class="org-ul">
<li>目标是为类型提供方法调用</li>
<li>但不是以 Java/C++/Python OOP 形式</li>
<li>更像是 lisp/scheme 中的 GOOP 形式，或 Clojure 中的 Protocol</li>
<li>要满足 interface，必须要使用 method</li>
<li>其它情况 method 和 function 都可使用</li>
<li>对于指针的方法，可以用 <code>x.m()</code> 来简写 <code>(&amp;x).m</code></li>
</ul>
</div>
</div>

<div id="outline-container-org220cdbe" class="outline-3">
<h3 id="org220cdbe"><span class="todo TODO">TODO</span> 继承关系</h3>
</div>
</div>



<div id="outline-container-org2412c37" class="outline-2">
<h2 id="org2412c37">类型转换</h2>
<div class="outline-text-2" id="text-org2412c37">
<ul class="org-ul">
<li>通过操作符(operator)来转换（与函数形式一样，本质上有所不同）</li>
<li>字符串可以转换为 <code>byte[]</code> 或 <code>rune[]</code> ，反之亦然</li>
<li>自定义类型与其别名之间可以相互转换</li>
</ul>
</div>
</div>

<div id="outline-container-org429073f" class="outline-2">
<h2 id="org429073f">Interface</h2>
<div class="outline-text-2" id="text-org429073f">
</div><div id="outline-container-org88bfd05" class="outline-3">
<h3 id="org88bfd05">意义</h3>
<div class="outline-text-3" id="text-org88bfd05">
<ul class="org-ul">
<li>用于函数定义与类型绑定 GOOPS</li>
<li>定义一个 interface 类型，表示方法的集合: 鸭子类型</li>
<li>Go 可以使用 interface 类型作为参数类型，称为 interface value</li>
</ul>
</div>
</div>

<div id="outline-container-org0f3cbf3" class="outline-3">
<h3 id="org0f3cbf3">示例</h3>
<div class="outline-text-3" id="text-org0f3cbf3">
<div class="org-src-container">
<pre class="src src-go">type I interface {
  Get() int
  Put(int)
}

func f( p I ) {
  fmt.Println( p.Get() )
  p.Put(1)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3323aa0" class="outline-3">
<h3 id="org3323aa0">拆分多态</h3>
<div class="outline-text-3" id="text-org3323aa0">
<div class="org-src-container">
<pre class="src src-go">func f(p I) {
  switch t := p.(type) {
    case *S:
    case *R:
    default:
}
</pre>
</div>

<p>
其中 <code>(.type)</code> 语法只在 switch 中有效，也可以写成
</p>

<div class="org-src-container">
<pre class="src src-go">if t, ok := something.(I); ok {
   // 检查 something 是否实现了接口 I
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdfea571" class="outline-3">
<h3 id="orgdfea571">Empty Interface</h3>
<div class="outline-text-3" id="text-orgdfea571">
<ul class="org-ul">
<li>每个类型都默认实现了 <code>interface{}</code></li>
<li>用于创建通用函数</li>
<li>通用函数，动态的获取其中的函数</li>
</ul>
</div>

<div id="outline-container-org5a16082" class="outline-4">
<h4 id="org5a16082">示例</h4>
<div class="outline-text-4" id="text-org5a16082">
<div class="org-src-container">
<pre class="src src-go">func g( something interface{} ) int {
    return something.(I).Get()
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb9a6ce8" class="outline-3">
<h3 id="orgb9a6ce8">Methods</h3>
<div class="outline-text-3" id="text-orgb9a6ce8">
<ul class="org-ul">
<li>Methods are functions that have a receiver</li>
<li>可以对任何类型定义方法，包括内置类型（除了 int 之外）</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4f981b" class="outline-3">
<h3 id="orgc4f981b"><span class="todo TODO">TODO</span> Methods on interface faces</h3>
<div class="outline-text-3" id="text-orgc4f981b">
<ul class="org-ul">
<li>An interface defines a set of methods : 定义</li>
<li>A method contains the actual code ： 实现</li>
<li>receiver can not be an interface type?</li>
</ul>
</div>

<div id="outline-container-org6cafbba" class="outline-4">
<h4 id="org6cafbba">receiver type</h4>
<div class="outline-text-4" id="text-org6cafbba">
<ul class="org-ul">
<li>有两种形式 <code>T</code> 或者 <code>*T</code></li>
<li>T is called the base type</li>
<li>T must not be a pointer or interface type</li>
<li>T must be declared in the same package as the method</li>
<li>不应该对 interface value 作指针</li>
</ul>
</div>
</div>

<div id="outline-container-org90b8a54" class="outline-4">
<h4 id="org90b8a54">Interface names</h4>
<div class="outline-text-4" id="text-org90b8a54">
<ul class="org-ul">
<li>如果只有一个方法，以 <code>-er</code> 为后缀，如 Reader, Writer, Formatter</li>
<li>方法名避免与标准函数重名</li>
</ul>
</div>
</div>
</div>







<div id="outline-container-orgf5cc39c" class="outline-3">
<h3 id="orgf5cc39c"><span class="todo TODO">TODO</span> tag</h3>
</div>
<div id="outline-container-org23f9cb8" class="outline-3">
<h3 id="org23f9cb8">Introspection and reflection</h3>
<div class="outline-text-3" id="text-org23f9cb8">
</div><div id="outline-container-org87d9f1d" class="outline-4">
<h4 id="org87d9f1d">示例</h4>
<div class="outline-text-4" id="text-org87d9f1d">
<div class="org-src-container">
<pre class="src src-go">type Person struct {
    name string "namestr"
    age int
}


func ShowTag( i interface[] ) {
    switch t:= reflect.TypeOf(i); t.Kind() {
    case reflect.Ptr:
	tag := t.Elem().Field(0).Tag
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org9cdc669" class="outline-4">
<h4 id="org9cdc669"><span class="todo TODO">TODO</span> 说明</h4>
<div class="outline-text-4" id="text-org9cdc669">
<ul class="org-ul">
<li>要通过内存中的变量，得到关于结构体等定义信息</li>
<li>用于区分 type 和 value</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org8c532ff" class="outline-2">
<h2 id="org8c532ff">Concurrency</h2>
<div class="outline-text-2" id="text-org8c532ff">
</div><div id="outline-container-org537ee9e" class="outline-3">
<h3 id="org537ee9e">概述</h3>
<div class="outline-text-3" id="text-org537ee9e">
<ul class="org-ul">
<li>Parallelism is about performance.</li>
<li>Concurrency is about program design</li>
<li>核心是 channel 和 goroutine</li>
</ul>
</div>
</div>

<div id="outline-container-orgf7559ad" class="outline-3">
<h3 id="orgf7559ad">goroutine</h3>
<div class="outline-text-3" id="text-orgf7559ad">
<blockquote>
<p>
It is a function executing in parallel with other goroutines in the same address sapce. 
It is lightweight, cosing little more than the allocation of stack space.
And the stacks start small, so they are cheap, and grow by 
allocating( and freeing) heap storage as required.
</p>
</blockquote>
</div>

<div id="outline-container-orgff97c54" class="outline-4">
<h4 id="orgff97c54">说明</h4>
<div class="outline-text-4" id="text-orgff97c54">
<ul class="org-ul">
<li>普通函数，以关键字 <code>go</code> 开头</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcc1e994" class="outline-3">
<h3 id="orgcc1e994">channel</h3>
<div class="outline-text-3" id="text-orgcc1e994">
</div><div id="outline-container-orge0e8c57" class="outline-4">
<h4 id="orge0e8c57">说明</h4>
<div class="outline-text-4" id="text-orge0e8c57">
<ul class="org-ul">
<li>类似于双向的 pipe</li>
<li>只能以 channel 定义的数据类型进行交流</li>
<li>通过 <code>make(chan int)</code> 来生成</li>
<li>可以交换 interface, <code>make(chan interface{})</code> !!!</li>
<li>通过 <code>&lt;-</code> 来发送信息和接收</li>
<li>使用函数 <code>select</code> 来监听接收信息</li>
</ul>
</div>
</div>

<div id="outline-container-org678cc87" class="outline-4">
<h4 id="org678cc87">示例</h4>
<div class="outline-text-4" id="text-org678cc87">
<div class="org-src-container">
<pre class="src src-go">func ready( w string, sec int ) {
    time.Sleep( time.Duration(sec) * time.Second )
    fmt.Println( w, "is ready" )
    c &lt;- w
}

func main() {
    c = make(chan string)
    go ready( "2sec", 2 )
    go ready( "1sec", 1 )
    fmt.Println( "I'm waiting" )
    fmt.Println( &lt;-c )
    fmt.Println( &lt;-c )
    fmt.Println( "over" )
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b45b41" class="outline-4">
<h4 id="org6b45b41">缓存</h4>
<div class="outline-text-4" id="text-org6b45b41">
<ul class="org-ul">
<li><code>make(chan bool)</code> 创建的是 unbuffered channel for bools</li>
<li>unbuffered channel 用于同步多个 goroutine</li>
<li><code>make(chan bool, 4)</code> 创建带缓存的 channel</li>
</ul>
</div>
</div>

<div id="outline-container-org0b5e7ec" class="outline-4">
<h4 id="org0b5e7ec">关闭</h4>
<div class="outline-text-4" id="text-org0b5e7ec">
<ul class="org-ul">
<li>channel 会被单向关闭</li>
<li>可以以 <code>x, ok = &lt;-ch</code> 来检查是否关闭（ok 为 false 表示关闭）</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgaf5e884" class="outline-3">
<h3 id="orgaf5e884">parallel</h3>
<div class="outline-text-3" id="text-orgaf5e884">
<ul class="org-ul">
<li>goroutine concurrently，而非并行</li>
<li>使用 <code>runtime.GOMAXPROCS(n)</code> 来设置最大并行度</li>
<li>也可以设置 <code>GOMAXPROCS</code> 环境变量</li>
<li>默认并行度是 CPU 的核数</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7420c0b" class="outline-2">
<h2 id="org7420c0b">Communication</h2>
<div class="outline-text-2" id="text-org7420c0b">
</div><div id="outline-container-orgf58d435" class="outline-3">
<h3 id="orgf58d435">清单</h3>
<div class="outline-text-3" id="text-orgf58d435">
<ul class="org-ul">
<li>与外界交互，如 file, directories, networking, system(shell)</li>
<li>I/O 接口 <code>io.Reader</code> 和 <code>io.Writer</code></li>
<li><code>os.Open</code>, <code>os.Close</code>, <code>os.Stdout</code>, <code>os.Stat</code>, <code>os.Mkdir</code></li>
<li><code>File.Read</code>, <code>File.Write</code></li>
<li>bufio( Buffered I/O ), 如 NewReader, NewWriter, Read, Write, Flush, ReadString, ReadLine</li>
<li>日志 <code>log</code>, 如 Fatalf</li>
</ul>
</div>
</div>

<div id="outline-container-orged3ca10" class="outline-3">
<h3 id="orged3ca10">命令行参数</h3>
<div class="outline-text-3" id="text-orged3ca10">
<ul class="org-ul">
<li>os.Args （类似于 sys.args in python）</li>
<li>flag 包来解析参数 （类似于 argparsers, optparser in python， getopt）</li>
<li><code>flag.{Bool,String}</code> , <code>flag.Usage</code>, <code>flag.Parse</code>, <code>flag.PrintDefaults</code></li>
</ul>
</div>
